; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	infrared0 - mode
	thermograph2 - mode
	spectrograph1 - mode
	Star2 - direction
	Star4 - direction
	Star1 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star8)
	(supports instrument9 infrared0)
	(supports instrument9 thermograph2)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
)
(:goal (and
	(pointing satellite1 Star8)
	(have_image Planet5 thermograph2)
	(have_image Phenomenon6 thermograph2)
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 infrared0)
	(have_image Star9 infrared0)
	(have_image Star10 spectrograph1)
	(have_image Phenomenon11 infrared0)
))

)

; plan
1. (turn_to satellite3 groundstation3 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 8
3. (calibrate satellite3 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 0 of 8
4. (turn_to satellite3 planet5 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet5)
   goals met: 0 of 8
5. (take_image satellite3 planet5 instrument6 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 1 of 8
6. (turn_to satellite3 phenomenon7 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 phenomenon7)
   goals met: 1 of 8
7. (take_image satellite3 phenomenon7 instrument6 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 2 of 8
8. (turn_to satellite3 phenomenon6 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon6)
   goals met: 2 of 8
9. (take_image satellite3 phenomenon6 instrument6 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 3 of 8
10. (turn_to satellite3 phenomenon11 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 phenomenon11)
   goals met: 3 of 8
11. (take_image satellite3 phenomenon11 instrument6 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 4 of 8
12. (turn_to satellite1 star8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star8)
   goals met: 5 of 8
13. (turn_to satellite3 star10 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star10)
   goals met: 5 of 8
14. (take_image satellite3 star10 instrument6 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 6 of 8
15. (turn_to satellite3 star8 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star8)
   goals met: 6 of 8
16. (take_image satellite3 star8 instrument6 infrared0)
   added: (have_image star8 infrared0)
   goals met: 7 of 8
17. (turn_to satellite3 star9 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star9)
   goals met: 7 of 8
18. (take_image satellite3 star9 instrument6 infrared0)
   added: (have_image star9 infrared0)
   goals met: 8 of 8
